uat_chat/Catalogs/уатВидыДДД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>уатВидыДДД</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КонтрольВПЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляСотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>стрОтветсвенные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательныйДляВсех</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноеПодразделениеЕсть</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсключаемыеОбъектыКонтроля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектКонтроля</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТипыТС</v8:Type>
								<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
								<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лог</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтветственныеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Емайл</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>55</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>WhatsApp</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лог</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПодразделенияФильтр</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исключить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

uat_chat/InformationRegisters/уатСведенияОСотрудниках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>уатСведенияОСотрудниках</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>идДОк</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.уатОсновныеНачисления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Позывной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСтажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/Catalogs/уатСотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>уатСотрудники</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Основная организация сотрудника</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриема</Name>
					<Comment>Дата приема на работу</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Comment>Дата увольнения с работы</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислятьЗПВПЛ</Name>
					<Comment>Начислять зарплату в путевых листах</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доверенность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>77</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

uat_chat/Catalogs/уатВидыДДД/Ext/ManagerModule.bsl
Функция ПроверкаОтветсвенного(ссВидДДД) Экспорт
	
	Если ЗначениеЗаполнено(ссВидДДД)=Ложь ТОгда Возврат Истина; КонецЕсли; 
	
	текФЛ = ПараметрыСеанса.ТекущийПользователь.ФизЛицо;
	//Если ЗначениеЗаполнено(текФЛ)=Ложь Тогда
	//	Сообщить("У пользователя "+ПараметрыСеанса.ТекущийПользователь+" не выбрано поле <Физ лицо>");
	//	Возврат Ложь;
	//КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФЛ",текФЛ);
	Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Ссылка",ссВидДДД);
	Запрос.УстановитьПараметр("Дт",ТекущаяДата());
	Запрос.Текст = "ВЫБРАТЬ TOP 1
	               |	уатВидыДДДОтветственныеЛица.Ответственный
	               |ИЗ
	               |	Справочник.уатВидыДДД.ОтветственныеЛица КАК уатВидыДДДОтветственныеЛица
	               |ГДЕ
	               |	уатВидыДДДОтветственныеЛица.Ответственный в (&ФЛ,&Пользователь)
	               |	И уатВидыДДДОтветственныеЛица.Ссылка = &Ссылка
				   |
				   |UNION ALL
				   |
				   |
|ВЫБРАТЬ
|	уатСведенияОСотрудникахСрезПоследних.ПодразделениеОрганизации
|ИЗ
|	РегистрСведений.уатСведенияОСотрудниках.СрезПоследних(&Дт, Сотрудник.ФизЛицо = &фл и (Сотрудник.ДатаУвольнения > &Дт or Сотрудник.ДатаУвольнения = ДатаВремя(1,1,1)) ) КАК уатСведенияОСотрудникахСрезПоследних
|		INNER JOIN Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
|		ПО уатСведенияОСотрудникахСрезПоследних.ПодразделениеОрганизации = ПодразделенияОрганизаций.Ссылка
|		
|WHERE  ПодразделенияОрганизаций.Ссылка в иерархии (SELECT Ответственный FROM Справочник.уатВидыДДД.ОтветственныеЛица КАК спр1 WHERE спр1.ссылка = &Ссылка)
|		
|";
		
		
Рез = Запрос.Выполнить().Пустой();	
Если Рез ТОгда
	Сообщить("У пользователя "+ПараметрыСеанса.ТекущийПользователь+" нет прав для редактирования документа "+ссВидДДД);
	Возврат ЛОжь;
КонецеСЛИ;

Возврат Истина;
	
КонецФункции

Функция ПолучитьМассивДоступныхДокументов(дляСотр=Неопределено,дляТС=Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
|ВЫБРАТЬ DISTINCT
|	СправочникуатВидыДДД.Ссылка
|ИЗ
|	Справочник.уатВидыДДД КАК СправочникуатВидыДДД
|INNER JOIN Справочник.уатВидыДДД.ОтветственныеЛица СпрОтв ON СпрОтв.ссылка = СправочникуатВидыДДД.ссылка

|LEFT OUTER JOIN Справочник.ПодразделенияОрганизаций Спр1 ON Спр1.ссылка IN (SELECT ПодразделениеОрганизации FROM РегистрСведений.уатСведенияОСотрудниках.СрезПоследних(&Дт, Сотрудник.ФизЛицо = &фл и (Сотрудник.ДатаУвольнения > &Дт or Сотрудник.ДатаУвольнения = ДатаВремя(1,1,1)) ) КАК уатСведенияОСотрудникахСрезПоследних)
|LEFT OUTER JOIN Справочник.ПодразделенияОрганизаций Спр2 ON Спр1.Родитель = Спр2.Ссылка
|LEFT OUTER JOIN Справочник.ПодразделенияОрганизаций Спр3 ON Спр2.Родитель = Спр3.Ссылка
|LEFT OUTER JOIN Справочник.ПодразделенияОрганизаций Спр4 ON Спр3.Родитель = Спр4.Ссылка
|LEFT OUTER JOIN Справочник.ПодразделенияОрганизаций Спр5 ON Спр4.Родитель = Спр5.Ссылка
|LEFT OUTER JOIN Справочник.ПодразделенияОрганизаций Спр6 ON Спр5.Родитель = Спр6.Ссылка
|LEFT OUTER JOIN Справочник.ПодразделенияОрганизаций Спр7 ON Спр6.Родитель = Спр7.Ссылка
|LEFT OUTER JOIN Справочник.ПодразделенияОрганизаций Спр8 ON Спр7.Родитель = Спр8.Ссылка
|LEFT OUTER JOIN Справочник.ПодразделенияОрганизаций Спр9 ON Спр8.Родитель = Спр9.Ссылка

|WHERE (СпрОтв.Ответственный IN (&ФЛ,&Пользователь) 
|  или СпрОтв.Ответственный = Спр1.ссылка
|  или СпрОтв.Ответственный = Спр2.ссылка
|  или СпрОтв.Ответственный = Спр3.ссылка
|  или СпрОтв.Ответственный = Спр4.ссылка
|  или СпрОтв.Ответственный = Спр5.ссылка
|  или СпрОтв.Ответственный = Спр6.ссылка
|  или СпрОтв.Ответственный = Спр7.ссылка
|  или СпрОтв.Ответственный = Спр8.ссылка
|  или СпрОтв.Ответственный = Спр9.ссылка
|  )
|  и ( СправочникуатВидыДДД.дляТС   = &дляТС   или &дляТС = Неопределено)
|  и ( СправочникуатВидыДДД.дляСотр = &дляСотр или &дляСотр = Неопределено)
|
|";
	Запрос.УстановитьПараметр("ФЛ",ПараметрыСеанса.ТекущийПользователь.ФизЛицо);
	Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Дт",ТекущаяДата());
	Запрос.УстановитьПараметр("дляТС",дляТС);
	Запрос.УстановитьПараметр("дляСотр",дляСотр);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ПолучитьТблНачАвтоколон(Сотр) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
|ВЫБРАТЬ
|	уатСведенияОСотрудникахСрезПоследних.Сотрудник,
|	уатСведенияОСотрудникахСрезПоследних.ПодразделениеОрганизации,
|	уатСведенияОСотрудникахСрезПоследних.Должность
|ИЗ
|	РегистрСведений.уатСведенияОСотрудниках.СрезПоследних(,Сотрудник.ФизЛицо = &Сотр или &Сотр=Значение(Справочник.ФизическиеЛица.ПустаяСсылка) ) КАК уатСведенияОСотрудникахСрезПоследних
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.уатСотрудники КАК уатСотрудники
|		ПО уатСведенияОСотрудникахСрезПоследних.Сотрудник = уатСотрудники.Ссылка
|ГДЕ
|	уатСведенияОСотрудникахСрезПоследних.Должность.Наименование ПОДОБНО ""%начальник%""
|	И (уатСведенияОСотрудникахСрезПоследних.ПодразделениеОрганизации.Наименование ПОДОБНО ""%колон%""
|			ИЛИ уатСведенияОСотрудникахСрезПоследних.ПодразделениеОрганизации.Наименование ПОДОБНО ""%цех%"")
|	И уатСотрудники.ДатаУвольнения = ДатаВремя(1,1,1)
|
|";
	Запрос.УстановитьПараметр("Сотр",Сотр);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура Отчет(Зн) Экспорт
	Если ЗначениеЗаполнено(Зн) =Ложь ТОгда Возврат; КонецеСЛИ;
	
	Обк = Отчеты.ОтчетПоДокументам.Создать();
	Обк.ФильтрСотрТС = Зн;
	Обк.ПолучитьФорму("ФормаОтчета1",,"МенеджерУатВидыДДД").Открыть();
	
КонецПроцедуры
